Pandas基于numpy开发。可以先学习numpy。

__Series__ and __DataFrame__ are two data structures in pandas.

| 数据结构  | 特点 |
| ------------- | ------------- |
| Series  | 一维，带标签的数组  |
| DataFrame  | 二维，跟R里类似  |

## 1. Create a data structure

In [2]:
import numpy as np
import pandas as pd

Series generate index automatically.

In [3]:
ss = pd.Series([2,6,7,8,np.nan,-4])
print(ss)

0    2.0
1    6.0
2    7.0
3    8.0
4    NaN
5   -4.0
dtype: float64

In [4]:
df = pd.DataFrame(np.random.randn(10,2), columns=["midterm","final"])
print(df)

    midterm     final
0  0.309026 -1.321077
1  1.363719 -0.485721
2  0.664508  0.494799
3 -0.057517  0.563656
4  0.425842 -0.614229
5  0.076269  0.407188
6  0.545763 -1.307066
7 -0.257711 -0.240662
8 -0.213158  3.102344
9  3.070897  1.596637

We can also create a DataFrame via a dictionary. You can see that there are different types of data in it.

In [5]:
 df2 = pd.DataFrame({'A': 1.,
                      'B': pd.Timestamp('20130102'),
                  'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                  'D': np.array([3] * 4, dtype='int32'),
                   'E': pd.Categorical(["test", "train", "test", "train"]),
                   'F': 'foo'})
print(df2)
print('\n',df2.dtypes)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

 A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## 2. View data

In [6]:
df.head()  # pretty table

#df.tail()

    midterm     final
0  0.309026 -1.321077
1  1.363719 -0.485721
2  0.664508  0.494799
3 -0.057517  0.563656
4  0.425842 -0.614229

In [7]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [8]:
df.columns

Index(['midterm', 'final'], dtype='object')

`.to_numpy` transform df to numpy object. numpy has uniform data type.

In [9]:
df.to_numpy()

array([[ 0.30902606, -1.32107676],
       [ 1.36371894, -0.48572144],
       [ 0.66450821,  0.49479942],
       [-0.05751686,  0.5636559 ],
       [ 0.42584248, -0.6142292 ],
       [ 0.07626916,  0.40718814],
       [ 0.5457628 , -1.30706572],
       [-0.25771095, -0.24066184],
       [-0.21315834,  3.10234401],
       [ 3.07089666,  1.59663732]])

In [10]:
df.describe()    # summary() in R

         midterm      final
count  10.000000  10.000000
mean    0.592764   0.219587
std     0.995193   1.355840
min    -0.257711  -1.321077
25%    -0.024070  -0.582102
50%     0.367434   0.083263
75%     0.634822   0.546442
max     3.070897   3.102344

Sorting is available in df

In [11]:
df.sort_index(axis=1)   # sort by name of columns

      final   midterm
0 -1.321077  0.309026
1 -0.485721  1.363719
2  0.494799  0.664508
3  0.563656 -0.057517
4 -0.614229  0.425842
5  0.407188  0.076269
6 -1.307066  0.545763
7 -0.240662 -0.257711
8  3.102344 -0.213158
9  1.596637  3.070897

In [12]:
df.sort_values(by='final')  # sort by values in column "final"

    midterm     final
0  0.309026 -1.321077
6  0.545763 -1.307066
4  0.425842 -0.614229
1  1.363719 -0.485721
7 -0.257711 -0.240662
5  0.076269  0.407188
2  0.664508  0.494799
3 -0.057517  0.563656
9  3.070897  1.596637
8 -0.213158  3.102344

## 3. Selection

In [13]:
df.midterm      # equivalent to df["midterm"]

0    0.309026
1    1.363719
2    0.664508
3   -0.057517
4    0.425842
5    0.076269
6    0.545763
7   -0.257711
8   -0.213158
9    3.070897
Name: midterm, dtype: float64

In [14]:
df[0:3]  # first 3 rows

    midterm     final
0  0.309026 -1.321077
1  1.363719 -0.485721
2  0.664508  0.494799

In [15]:
df.iloc[1,1]  # select by location

-0.48572143528457234

In [16]:
df[df["final"]>0]  # select by boolean

    midterm     final
2  0.664508  0.494799
3 -0.057517  0.563656
5  0.076269  0.407188
8 -0.213158  3.102344
9  3.070897  1.596637

We can also use `is.in()`

In [17]:
df["grade"] = np.repeat(["A","C"],5)
print(df)

    midterm     final grade
0  0.309026 -1.321077     A
1  1.363719 -0.485721     A
2  0.664508  0.494799     A
3 -0.057517  0.563656     A
4  0.425842 -0.614229     A
5  0.076269  0.407188     C
6  0.545763 -1.307066     C
7 -0.257711 -0.240662     C
8 -0.213158  3.102344     C
9  3.070897  1.596637     C

In [18]:
df[df["grade"].isin(["A"])]  # select those who got "A"

    midterm     final grade
0  0.309026 -1.321077     A
1  1.363719 -0.485721     A
2  0.664508  0.494799     A
3 -0.057517  0.563656     A
4  0.425842 -0.614229     A

## 4. Missing values

In [32]:
df["gender"] = np.nan
df.loc[0:3,"gender"] = "M"
print(df)

    midterm     final grade gender
0  0.309026 -1.321077     A      M
1  1.363719 -0.485721     A      M
2  0.664508  0.494799     A      M
3 -0.057517  0.563656     A      M
4  0.425842 -0.614229     A    NaN
5  0.076269  0.407188     C    NaN
6  0.545763 -1.307066     C    NaN
7 -0.257711 -0.240662     C    NaN
8 -0.213158  3.102344     C    NaN
9  3.070897  1.596637     C    NaN

delete observations with NaN

In [35]:
df.dropna(how="any")

    midterm     final grade gender
0  0.309026 -1.321077     A      M
1  1.363719 -0.485721     A      M
2  0.664508  0.494799     A      M
3 -0.057517  0.563656     A      M

replace NaN with values

In [36]:
df.fillna(value="F")

    midterm     final grade gender
0  0.309026 -1.321077     A      M
1  1.363719 -0.485721     A      M
2  0.664508  0.494799     A      M
3 -0.057517  0.563656     A      M
4  0.425842 -0.614229     A      F
5  0.076269  0.407188     C      F
6  0.545763 -1.307066     C      F
7 -0.257711 -0.240662     C      F
8 -0.213158  3.102344     C      F
9  3.070897  1.596637     C      F

check if a cell is missing

In [37]:
pd.isna(df)

   midterm  final  grade  gender
0    False  False  False   False
1    False  False  False   False
2    False  False  False   False
3    False  False  False   False
4    False  False  False    True
5    False  False  False    True
6    False  False  False    True
7    False  False  False    True
8    False  False  False    True
9    False  False  False    True

## 5. Statistics

In [38]:
df.mean()

midterm    0.592764
final      0.219587
dtype: float64

`apply` function

In [42]:
df[["final","midterm"]].apply(np.cumsum)

      final   midterm
0 -1.321077  0.309026
1 -1.806798  1.672745
2 -1.311999  2.337253
3 -0.748343  2.279736
4 -1.362572  2.705579
5 -0.955384  2.781848
6 -2.262450  3.327611
7 -2.503111  3.069900
8  0.599233  2.856741
9  2.195870  5.927638

In [44]:
df[["final"]].apply(lambda x:x.max()-x.min())

final    4.423421
dtype: float64

Histogram (`table()` in R)

In [56]:
df2 = pd.Series(np.random.randint(0,10,size=100))
df2.head()

0    5
1    8
2    8
3    7
4    2
dtype: int64

In [57]:
df2.value_counts()

9    20
4    13
8    11
7    11
2     9
3     8
1     8
0     8
6     6
5     6
dtype: int64

## 6. Merge

### concatenate

In [74]:
train = [df[1:3],df[7:8]]
train

[    midterm     final grade gender
 1  1.363719 -0.485721     A      M
 2  0.664508  0.494799     A      M,     midterm     final grade gender
 7 -0.257711 -0.240662     C    NaN]

In [75]:
pd.concat(train)

    midterm     final grade gender
1  1.363719 -0.485721     A      M
2  0.664508  0.494799     A      M
7 -0.257711 -0.240662     C    NaN

### join

根据每个对象的 __键(key)__ 来合并信息

In [78]:
left = pd.DataFrame({"id":[1001,1002,1003],"gender":["M","F","M"]})
left

     id gender
0  1001      M
1  1002      F
2  1003      M

In [80]:
right = pd.DataFrame({"id":[1001,1002,1003],"score":[10,8,9]})
right

     id  score
0  1001     10
1  1002      8
2  1003      9

In [81]:
pd.merge(left,right,on = "id")

     id gender  score
0  1001      M     10
1  1002      F      8
2  1003      M      9

### append

添加新对象

In [83]:
df3 = df[0:3]
df3

    midterm     final grade gender
0  0.309026 -1.321077     A      M
1  1.363719 -0.485721     A      M
2  0.664508  0.494799     A      M

In [85]:
new = df[8:9]
df3.append(new)

    midterm     final grade gender
0  0.309026 -1.321077     A      M
1  1.363719 -0.485721     A      M
2  0.664508  0.494799     A      M
8 -0.213158  3.102344     C    NaN

In [86]:
df3.append(new,ignore_index=True)

    midterm     final grade gender
0  0.309026 -1.321077     A      M
1  1.363719 -0.485721     A      M
2  0.664508  0.494799     A      M
3 -0.213158  3.102344     C    NaN

## 7. Grouping

In [100]:
df4 = df.fillna(value="F")
df4

    midterm     final grade gender
0  0.309026 -1.321077     A      M
1  1.363719 -0.485721     A      M
2  0.664508  0.494799     A      M
3 -0.057517  0.563656     A      M
4  0.425842 -0.614229     A      F
5  0.076269  0.407188     C      F
6  0.545763 -1.307066     C      F
7 -0.257711 -0.240662     C      F
8 -0.213158  3.102344     C      F
9  3.070897  1.596637     C      F

We group by __gender__ and find sum for male and female

In [109]:
df4.groupby("grade").sum()

        midterm     final
grade
A      2.705579 -1.362572
C      3.222059  3.558442

We can also build blocks by combining __gender__ and __grade__

In [112]:
df4.groupby(["grade","gender"]).mean()

               midterm     final
grade gender
A     F       0.425842 -0.614229
      M       0.569934 -0.187086
C     F       0.644412  0.711688